print('''Ввиберіть цифру що відповідає вашому тарифу(1, 2 або 3):
1) 1000
2) 2000
3) 5000''')
n = int(input('Введіть цифру: '))

if n == 1:
    print('Ваш тариф включає 1000 мб інтернету')
    m = int(input('Введіть кількість використаних мб інтернету: '))
    if m <= 1000:
        print('Ви повинні заплатити 20 грн')
        print('За тарифом "2000" ви б заплатили 35 грн')
        print('За тарифом "5000" ви б заплатили 85 грн')
    elif m <= 2000:
        a = m - 1000 #1000
        b = a * 0.05
        c = 20 + b
        print('Ви повинні заплатити ', round(c, 2),' грн')
        print('За тарифом "2000" ви б заплатили 35 грн')
        print('За тарифом "5000" ви б заплатили 85 грн')
    elif 2000 < m <= 5000:
        a = m - 1000 #1000
        b = a * 0.05
        c = 20 + b
        print('Ви повинні заплатити ',round(c, 2),' грн')
        d = m - 2000 #2000
        e = d * 0.04
        g = 35 + e
        print('За тарифом "2000" ви б заплатили',round(g, 2),'грн')
        print('За тарифом "5000" ви б заплатили 85 грн')
    elif m > 5000:
        a = m - 1000 #1000
        b = a * 0.05
        c = 20 + b
        print('Ви повинні заплатити ',round(c, 2),' грн')
        d = m - 2000 #2000
        e = d * 0.04
        g = 35 + e
        print('За тарифом "2000" ви б заплатили',round(g, 2),'грн')
        q = m - 5000 #5000
        w = q * 0.02
        e = 85 + w
        print('За тарифом "5000" ви б заплатили',round(e, 2),'грн')
   
elif n == 2:
    print('Ваш тариф включає 2000 мб інтернету')
    m = int(input('Введіть кількість використаних мб інтернету: '))
    if m <= 1000:
        print('Ви повинні заплатити 35 грн')
        print('За тарифом "1000" ви б заплатили 20 грн')
        print('За тарифом "5000" ви б заплатили 85 грн')
    elif m <= 2000:
        print('Ви повинні заплатити 35 грн')
        a = m - 1000 #1000
        b = a * 0.05
        c = 20 + b
        print('За тарифом "1000" ви б заплатили ',round(c, 2),' грн')
        print('За тарифом "5000" ви б заплатили 85 грн')
    elif 2000 < m <= 5000:
        a = m - 2000 #2000
        b = a * 0.04
        c = 35 + b
        print('Ви повинні заплатити ',round(c, 2),' грн')
        d = m - 1000 #1000
        e = d * 0.05
        g = 20 + e
        print('За тарифом "1000" ви б заплатили',round(g, 2),'грн')
        print('За тарифом "5000" ви б заплатили 85 грн')
    elif m > 5000:
        a = m - 2000 #2000
        b = a * 0.04
        c = 35 + b
        print('Ви повинні заплатити ',round(c, 2),' грн')
        d = m - 1000 #1000
        e = d * 0.05
        g = 20 + e
        print('За тарифом "1000" ви б заплатили',round(g, 2),'грн')
        q = m - 5000 #5000
        w = q * 0.02
        e = 85 + w
        print('За тарифом "5000" ви б заплатили',round(e, 2),'грн')
        
        
elif n == 3:
    print('Ваш тариф включає 5000 мб інтернету')
    m = int(input('Введіть кількість використаних мб інтернету: '))
    if m <= 5000:
        print('Ви повинні заплатити 85 грн')
    elif m > 5000:
        a = m - 5000
        b = a * 0.02
        c = 85 + b
        print('Ви повинні заплатити',round(c, 2),'грн')

import datetime
def printTimeStamp(name):
 print('Автор програми: ' + name)
 print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp("Макс Шпак")
