n = int(input('Введіть рівень шуму в кімнаті (ДБ): '))

if 0 <= n <= 40:
    print('Ваш рівень шуму відповідає рівною "Тиха кімната"')

elif 41 <= n <= 70:
    print('Ваш рівень шуму в проміжку "Тиха кімната" та "Будильник"')
elif 71 <= n <= 106:
    print('Ваш рівень шуму в проміжку "Будильник" та "Бензинова газонокосарка"')
elif 107 <= n <= 130:
    print('Ваш рівень шуму в проміжку "Бензинова газонокосарка" та "Відбійний молоток"')
elif n > 130:
    print ('Ваш рівень шуму вищий за "Відбійний молоток"')
    
