n = int(input('Введіть рівень шуму в кімнаті (Дб): '))

if 0 <= n <= 40:
       print('Ваш рівень шуму відповідає рівню "Тиха кімната"')
elif 41 <= n <= 70:
       print('Ваш рівень шуму відповідає рівню "Будильник"')
elif 71 <= n <=106:
       print('Ваш рівень шуму відповідає рівню "Бензинова газонокосарка"')
elif 107 <= n <= 130:
       print('Ваш рівень шуму відповідає рівню "Відбійний молоток"')


import datetime
def printTimeStamp(name):
 print('Автор програми: ' + name)
 print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp("Макс Шпак")

