print('''Введіть число що відповідає вашому місцю проживання(1, 2 або 3):
1)Будинок
2)Квартира
3)Гуртожиток''')
a = int(input('Введіть число: '))

if a == 1:
    b = int(input('Введіть кількість годин які ви проводите вдома: '))
    if b <= 10:
        print('Ми рекомендуємо вам завести змію')
    elif 10 < b <= 17:
        print('Ми рекомендуємо вам завести собаку')
    elif b >= 18:
        print('Ми рекомендуємо завести вам Вєтнамське порося')
        
elif a == 2:
    b = int(input('Введіть кількість годин які ви проводите в квартирі: '))
    if b <= 10:
        print('Ми рекомендуємо завести вам хомяка')
    elif b > 10:
        print('Ми рекомендуємо завести вам кішку')
        
elif a == 3:
    b = int(input('Введіть кількість годин які ви проводите в гуртожитку: '))
    if b <= 6:
        print('Ит рекомендуємо завести вам мурашник')
    if b > 6:
        print('Ит рекомендуємо завести вам рибок')

import datetime
def printTimeStamp(name):
 print('Автор програми: ' + name)
 print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp("Макс Шпак")
