n = int(input('Введіть кількість кубометрів використоної води: '))

if n <= 30:
    a = n * 9.86
    b = a + 20
    print('Ви повинні заплатити',round(b, 2), 'грн')
elif 30 < n <= 50:
    a = 30 * 9.86
    b = n - 30
    c = b * 11.22
    e = a + c
    print('Ви повинні заплатити',round(e, 2), 'грн')
elif 50 < n <= 60:
    a = 30 * 9.86
    b = 20 * 11.22
    c = n - 50
    d = c * 13.06
    q = a + b + d
    print('Ви повинні заплатити', round(q,2),'грн')
elif n > 60:
    a = 30 * 9.86
    b = 20 * 11.22
    c = 10 * 13.06
    d = n - 60
    e = d * 17.89
    h = a + b + c + e
    print('Ви повинні заплатити',round(h, 2),'грн')
